<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class GroupsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $group_names = [
            "АТ101",
            "АТ171",
            "АТ181",
            "АТ191",
            "ТГП",
            "ИС101",
            "ИС191",
            "КС181",
            "МА201",
            "МА291",
            "ОПН201",
            "ОПН202д",
            "ОПН281",
            "ОПН282д",
            "ОПН291",
            "П101",
            "П171",
            "П172",
            "П181",
            "П191",
            "ПБ101",
            "ПБ102д",
            "ПБ171",
            "ПБ181",
            "ПБ191",
            "ПК201",
            "ПК271",
            "ПК281",
            "САР281",
            "СП101",
            "СП171",
            "СП181",
            "СП182",
            "СП191",
            "Т171",
            "Т181",
            "Т191",
            "ТМ101",
            "ТМ181",
            "ТМ191",
            "ТМ171",
            "ТМ172",
            "ТП101",
            "ТП102д",
            "ТП181",
            "ТП191",
            "Э101",
            "Э181",
            "Э191",
            "ЭГС201",
            "ЭГС291",
            "ЭМ101",
            "ЭМ171",
            "ЭМ172д",
            "ЭМ102",
            "ЭМ181",
            "ЭМ191",
            "ЭМ192д",
            "ЭМ281",
            "ЭМ291"
        ];

        foreach ($group_names as $group_name){
            DB::table('groups')->insert([
                'name' => $group_name,
            ]);
        }
    }
}
